In [1]:
import pandas as pd

In [2]:
sales_data = {
    'SaleID': [1, 2, 3, 4, 5],
    'Region': ['North', 'South', 'West', 'North', 'South'],
    'Amount': [650, 750, 800, 450, 900],
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05']
}
sales_df = pd.DataFrame(sales_data)

In [3]:
sales_df.head(1)

   SaleID Region  Amount        Date
0       1  North     650  2024-01-01

In [4]:
regions_data = {
    'Region': ['North', 'South', 'West'],
    'Manager': ['Alice', 'Bob', 'Charlie']
}
regions_df = pd.DataFrame(regions_data)
regions_df.head(1)

  Region Manager
0  North   Alice

In [5]:
#Połącz dane z obu DataFrame'ów, aby dodać kolumnę Manager do sales na podstawie Region.

df_merged = sales_df.merge(regions_df, how='left', on='Region')
df_merged

   SaleID Region  Amount        Date  Manager
0       1  North     650  2024-01-01    Alice
1       2  South     750  2024-01-02      Bob
2       3   West     800  2024-01-03  Charlie
3       4  North     450  2024-01-04    Alice
4       5  South     900  2024-01-05      Bob

In [6]:
#Wyświetl tylko te wiersze, w których Amount > 700, i posortuj je według Manager.
df_merged[df_merged['Amount'] > 700].sort_values(by=["Manager"])

   SaleID Region  Amount        Date  Manager
1       2  South     750  2024-01-02      Bob
4       5  South     900  2024-01-05      Bob
2       3   West     800  2024-01-03  Charlie

In [7]:
df_left_data = {
    'ID': [1, 2, 3, 4],
    'Name': ['Hubert', 'Ola', 'Jadzia', 'Przemek'],
    'Salary': [5000, 6000, 5500, 5200]
}
df_left = pd.DataFrame(df_left_data)

df_right_data = {
    'ID': [1, 2, 3, 4],
    'Bonus': [500, 600, 450, 520]
}
df_right = pd.DataFrame(df_right_data)

In [13]:
#Ustaw ID jako indeks w obu DataFrame'ach i połącz je, aby dodać kolumnę Bonus do df_left.
df_lr = df_left.merge(df_right, how='left', on="ID").set_index("ID")
df_lr

       Name  Salary  Bonus
ID
1    Hubert    5000    500
2       Ola    6000    600
3    Jadzia    5500    450
4   Przemek    5200    520

In [14]:
#Oblicz nową kolumnę TotalCompensation, która sumuje Salary i Bonus
df_lr['TotalCompensation'] = df_lr['Salary'] + df_lr['Bonus']
df_lr.head(1)

      Name  Salary  Bonus  TotalCompensation
ID
1   Hubert    5000    500               5500

In [15]:
sales_missing_data = {
    'SaleID': [1, 2, 3, 4, 5],
    'Region': ['North', None, 'West', 'North', None],
    'Amount': [650, None, 800, None, 900],
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05']
}
sales_missing_df = pd.DataFrame(sales_missing_data)
sales_missing_df

   SaleID Region  Amount        Date
0       1  North   650.0  2024-01-01
1       2   None     NaN  2024-01-02
2       3   West   800.0  2024-01-03
3       4  North     NaN  2024-01-04
4       5   None   900.0  2024-01-05

In [16]:
#Wyświetl liczbę brakujących wartości w każdej kolumnie.
sales_missing_df.isna().sum()

SaleID    0
Region    2
Amount    2
Date      0
dtype: int64

In [41]:
#usuń wiersze, w których brakuje Region, ale zachowaj brakujące wartości w innych kolumnach.
d = sales_missing_df[sales_missing_df["Region"].isnull()] #wiersze, w ktorych nie ma Region
missing = sales_missing_df.drop([1,4]) #usunalem po indeksach, ktore wyszly w "d"
missing

#sales_missing_df = sales_missing_df[sales_missing_df["Region"].notna()]

   SaleID Region  Amount        Date
0       1  North   650.0  2024-01-01
2       3   West   800.0  2024-01-03
3       4  North     NaN  2024-01-04

In [45]:
amount_median = missing['Amount'].median()
#amount_median
#Uzupełnij brakujące wartości w Amount medianą tej kolumny.
missing['Amount'] = missing['Amount'].fillna(amount_median)
missing

   SaleID Region  Amount        Date
0       1  North   650.0  2024-01-01
2       3   West   800.0  2024-01-03
3       4  North   725.0  2024-01-04